package by.example.stepik.intensiveJava_JusanSingularity.part.level_5.example_5_2;

public class Main {

    public static void main(String[] args) {

        /**
         * Реализовать функцию isWhitespace, которая принимает символ c.
         * Функция должна вернуть true, если символ c представляет пробельный символ. Вернуть false в противоположном случае.
         */
        System.out.println(isWhitespace(' '));

        /**
         * Реализовать функцию isUpper, которая принимает символ c.
         * Функция должна вернуть true, если символ c представляет букву верхнего регистра.
         * Вернуть false в противоположном случае.
         */
        System.out.println(isUpper('A'));
    }

    public static boolean isWhitespace(char c) {
        // Написать решение сюда ↓

        return true;
    }

    public static boolean isUpper(char c) {
        // Написать решение сюда ↓

        return true;
    }


}
